web/src/test/resources/integrationtestTemplates/createDraftCertificateForIT.v3.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1"
    xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:CreateDraftCertificateResponder:3"
    xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:3"
    xmlns:urn3="urn:riv:clinicalprocess:healthcond:certificate:3">
   <soapenv:Header>
      <urn:LogicalAddress>1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:CreateDraftCertificate>
         <urn1:intyg>
            <urn1:typAvIntyg>
               <urn2:code>$data.certificateType$</urn2:code>
               <urn2:codeSystem>f6fb361a-e31d-48b8-8657-99b63912dd9b</urn2:codeSystem>
               <urn2:displayName>Certificate display name</urn2:displayName>
            </urn1:typAvIntyg>
            <urn1:patient>
               <urn3:person-id>
                  <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
                  <urn2:extension>$data.patientId$</urn2:extension>
               </urn3:person-id>
               <urn3:fornamn>Athena</urn3:fornamn>
               <urn3:efternamn>Andersson</urn3:efternamn>
               <urn3:mellannamn>A</urn3:mellannamn>
               <urn3:postadress>Athena avenue 1</urn3:postadress>
               <urn3:postnummer>123 45</urn3:postnummer>
               <urn3:postort>Athens</urn3:postort>
            </urn1:patient>
            <urn1:skapadAv>
               <urn1:personal-id>
                  <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                  <urn2:extension>$data.carePersonId$</urn2:extension>
               </urn1:personal-id>
               <urn1:fullstandigtNamn>Doktor Ajla</urn1:fullstandigtNamn>
               <urn1:enhet>
                  <urn1:enhets-id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>$data.unitId$</urn2:extension>
                  </urn1:enhets-id>
                  <urn1:enhetsnamn>Alfa care unit</urn1:enhetsnamn>
               </urn1:enhet>
            </urn1:skapadAv>
         </urn1:intyg>
      </urn1:CreateDraftCertificate>
   </soapenv:Body>
</soapenv:Envelope>
>>
